[
    "Instructor states the learning objective and previews the steps.",
    "Instructor defines a key term in one sentence.",
    "Instructor defines a key term and immediately gives an example.",
    "Instructor contrasts the key term with a similar term.",
    "Instructor lists prerequisites needed for this segment.",
    "Instructor provides a quick recap of the previous segment.",
    "Instructor summarizes the last concept in 3 bullet points.",
    "Instructor introduces a new concept with a motivating question.",
    "Instructor introduces a concept using a real-world use case (general).",
    "Instructor introduces a concept using a simple analogy.",
    "Instructor explains why the concept matters before teaching it.",
    "Instructor shows a roadmap slide of the lesson structure.",
    "Instructor presents an outline and marks the current section.",
    "Instructor explains a workflow at a high level, then zooms in.",
    "Instructor breaks a complex task into 3-5 steps.",
    "Instructor labels steps as Step 1/2/3 while progressing.",
    "Instructor explains “what we are solving/doing” before starting.",
    "Instructor sets up a problem with given information and goal.",
    "Instructor rewrites the problem statement in simpler terms.",
    "Instructor identifies inputs and outputs explicitly.",
    "Instructor draws a simple block diagram of the system.",
    "Instructor explains assumptions used in the segment.",
    "Instructor highlights constraints and why they matter.",
    "Instructor clarifies definitions of variables/terms on screen.",
    "Instructor creates a “legend” for symbols/notation.",
    "Instructor explains units/scale/conventions used.",
    "Instructor demonstrates how to choose an approach/method.",
    "Instructor compares two approaches and justifies one.",
    "Instructor explains common pitfalls before applying steps.",
    "Instructor warns about a frequent mistake and how to avoid it.",
    "Instructor does a step-by-step worked example.",
    "Instructor does a second worked example with different numbers/inputs.",
    "Instructor demonstrates the same process with a new variant case.",
    "Instructor solves an example and then checks the result.",
    "Instructor performs a sanity check and explains why it's reasonable.",
    "Instructor verifies the solution by plugging it back in.",
    "Instructor explains an intermediate step slowly, then continues.",
    "Instructor pauses to summarize progress so far.",
    "Instructor highlights a key transition step and annotates it.",
    "Instructor explains a rule/principle and then applies it.",
    "Instructor explains when the rule/principle does NOT apply.",
    "Instructor shows a counterexample to clarify boundaries.",
    "Instructor demonstrates an edge case and interprets it.",
    "Instructor simplifies a complex expression step-by-step.",
    "Instructor rearranges an expression to isolate a target quantity.",
    "Instructor explains a transformation and why it is valid.",
    "Instructor maps each step to a rule shown on a slide.",
    "Instructor uses color/highlighting to connect parts of the solution.",
    "Instructor annotates a diagram to show relationships.",
    "Instructor labels a figure and explains each label.",
    "Instructor points to a chart and explains axes and units.",
    "Instructor interprets a graph trend and states the takeaway.",
    "Instructor builds a graph from a small table of values.",
    "Instructor introduces a table and explains how to read it.",
    "Instructor demonstrates how to convert between representations.",
    "Instructor converts a narrative description into a structured form.",
    "Instructor converts a structured form back into plain language.",
    "Instructor demonstrates summarizing a process into a checklist.",
    "Instructor provides a mnemonic to remember steps.",
    "Instructor provides a rule-of-thumb and explains its limits.",
    "Instructor demonstrates a procedure while narrating each step.",
    "Instructor explains why each procedure step exists.",
    "Instructor shows a “before vs after” of applying the method.",
    "Instructor compares two outputs and explains differences.",
    "Instructor explains cause-and-effect between two steps.",
    "Instructor uses a “think-aloud” strategy to show decision-making.",
    "Instructor asks a quick self-check question and answers it.",
    "Instructor presents a mini-quiz and explains the solution.",
    "Instructor presents a multiple-choice item and eliminates options.",
    "Instructor shows a short exercise prompt and models the approach.",
    "Instructor explains grading criteria/rubric briefly (general).",
    "Instructor models how to interpret a prompt/instructions.",
    "Instructor demonstrates how to plan before executing steps.",
    "Instructor demonstrates how to check work for errors.",
    "Instructor notices a mistake and corrects it with explanation.",
    "Instructor debugs a wrong step and explains the fix.",
    "Instructor shows two common wrong answers and why they fail.",
    "Instructor explains how to avoid ambiguity in a solution.",
    "Instructor demonstrates systematic note-taking for the segment.",
    "Instructor summarizes the key result and restates it clearly.",
    "Instructor lists key takeaways at the end of the clip.",
    "Instructor provides a short recap and transitions to next concept.",
    "Instructor links the current concept to the next lesson's goal.",
    "Instructor links the concept to a previously learned idea.",
    "Instructor shows a concept map connecting related ideas.",
    "Instructor categorizes items into groups with labels.",
    "Instructor demonstrates classification with a few examples.",
    "Instructor compares and contrasts two categories.",
    "Instructor explains a hierarchy: overview → subparts → detail.",
    "Instructor introduces terminology and gives usage guidelines.",
    "Instructor clarifies pronunciation/terminology consistency (general).",
    "Instructor explains a standard convention used in the field (general).",
    "Instructor demonstrates reading a figure caption and extracting meaning.",
    "Instructor demonstrates reading a slide and extracting key points.",
    "Instructor demonstrates extracting variables/constraints from text.",
    "Instructor explains how to organize information in a table.",
    "Instructor demonstrates building a template for repeated tasks.",
    "Instructor uses a checklist to complete a task systematically.",
    "Instructor shows a “step tracker” and checks off steps.",
    "Instructor demonstrates applying the same method to a new dataset/input.",
    "Instructor demonstrates parameter choice and its impact (general).",
    "Instructor changes one input and explains what changes downstream.",
    "Instructor explains sensitivity: small change → effect on output.",
    "Instructor explains what information is needed before starting.",
    "Instructor explains what a final answer/output should look like.",
    "Instructor demonstrates formatting the final result (general).",
    "Instructor demonstrates documenting steps for reproducibility.",
    "Instructor demonstrates naming/labeling outputs clearly.",
    "Instructor demonstrates organizing files/folders/resources (general).",
    "Instructor demonstrates using a tool feature relevant to learning (general).",
    "Instructor demonstrates a UI workflow while explaining each click (general).",
    "Instructor demonstrates how to set up an environment/workspace (general).",
    "Instructor demonstrates a configuration setting and its effect (general).",
    "Instructor demonstrates importing/loading data/material (general).",
    "Instructor demonstrates cleaning/preparing inputs (general).",
    "Instructor demonstrates validating inputs before processing (general).",
    "Instructor demonstrates handling missing/unknown values (general).",
    "Instructor demonstrates selecting relevant features/fields (general).",
    "Instructor demonstrates filtering and explains criteria (general).",
    "Instructor demonstrates sorting and explains why it helps (general).",
    "Instructor demonstrates creating a summary statistic/metric (general).",
    "Instructor demonstrates interpreting a metric and drawing a conclusion.",
    "Instructor demonstrates comparing metrics across two cases.",
    "Instructor demonstrates choosing a threshold and explaining rationale.",
    "Instructor demonstrates evaluating performance with a simple rubric (general).",
    "Instructor demonstrates interpreting feedback and revising work.",
    "Instructor demonstrates iterative improvement: first draft → refined draft.",
    "Instructor demonstrates peer-review checklist style (general).",
    "Instructor demonstrates explaining reasoning, not just final answer.",
    "Instructor emphasizes clarity and shows how to write a clear step.",
    "Instructor demonstrates aligning solution steps with requirements.",
    "Instructor demonstrates aligning output with constraints.",
    "Instructor demonstrates how to handle exceptions/corner cases (general).",
    "Instructor demonstrates using a fallback strategy when stuck (general).",
    "Instructor demonstrates breaking a hard task into smaller tasks.",
    "Instructor demonstrates using a template example then customizing it.",
    "Instructor demonstrates mapping a concept to a diagram representation.",
    "Instructor demonstrates mapping a diagram back to a procedure.",
    "Instructor demonstrates using highlighting to track correspondences.",
    "Instructor demonstrates using a table to prevent missed cases.",
    "Instructor demonstrates summarizing an argument in 2-3 sentences (general).",
    "Instructor demonstrates identifying main point vs supporting details.",
    "Instructor demonstrates sequencing steps in the correct order.",
    "Instructor demonstrates prioritizing which step to do first (general).",
    "Instructor demonstrates time-saving shortcuts while staying correct (general).",
    "Instructor demonstrates why a shortcut works and when it's safe.",
    "Instructor demonstrates switching strategy mid-way with justification.",
    "Instructor demonstrates checking intermediate results to prevent drift.",
    "Instructor demonstrates interpreting intermediate results before proceeding.",
    "Instructor demonstrates concluding from evidence shown on screen.",
    "Instructor demonstrates explaining a result in plain language.",
    "Instructor demonstrates explaining a result in formal/structured language.",
    "Instructor demonstrates translating between two notations (general).",
    "Instructor demonstrates summarizing a long process into a formula/rule.",
    "Instructor demonstrates “do this, then do that” procedural narration.",
    "Instructor demonstrates setting up a reusable workflow for repeated tasks.",
    "Instructor demonstrates creating a reusable checklist for future problems.",
    "Instructor demonstrates final review: goal met, constraints satisfied.",
    "Instructor demonstrates a quick “key points” flash review.",
    "Instructor ends with a brief next-step recommendation tied to the lesson."
]