[
    "Accidental off-air moments: Recording continuing after class ends, capturing packing up, casual talk, or leaving the room.",
    "Accidental recordings of non-class audio: Pre-class chatter captured before the official start, like the teacher humming or talking on the phone.",
    "Accidental screen shares: Sharing the wrong window, revealing personal emails, browsers, or files.",
    "Accidental skip or cut",
    "Advertisements or banners: Pop-up ads, sponsor logos, or platform watermarks that aren't part of the lesson.",
    "Ambient fan or AC noise",
    "Audio delay or desync",
    "Audio echo from hybrid setup",
    "Audio feedback or echoes: High-pitched squeals from mic feedback, room echoes, or looping sounds from poor setup.",
    "Autofocus flicker",
    "Background distractions in the room: Moving pets, family members walking by, cluttered desks with unrelated items (e.g., toys, food wrappers).",
    "Background music or intro tune",
    "Background noises from the environment: Dogs barking, birds chirping, traffic sounds, construction noise, or household appliances (e.g., vacuum cleaner or washing machine running).",
    "Battery dying mid-lecture",
    "Blank or frozen screens: Static black/blue screens, loading icons, or frozen frames during transitions.",
    "Blank screen with ambient noise: No visuals but faint background hum (e.g., fan noise) – though minimal, it's irrelevant.",
    "Board cleaning or wiping",
    "Board glare or blocked view",
    "Break or intermission chatter",
    "Breaks or intermissions: Announced pauses like 'Let's take a 5-minute break,' with people chatting, stretching, or screens showing idle chat rooms.",
    "Camera adjustments: Teacher fiddling with the webcam angle, lighting, or background filters mid-recording.",
    "Camera cuts or transitions",
    "Camera moved silently",
    "Camera obstructed by people",
    "Camera repositioning or shaking",
    "Camera shake or tripod moved",
    "Camera view of ceiling or floor",
    "Camera zooming or refocusing",
    "Chair or desk dragging noises",
    "Classroom announcements or bell rings",
    "Co-presenter banter: Multiple hosts chatting about non-work topics, with back-and-forth visuals.",
    "Coughing, sneezing, or bodily sounds: Unedited health-related noises like heavy breathing, yawning, or sipping drinks loudly.",
    "Date/time stamp visible",
    "Device reflections or glare: Screen glare showing reflections of unrelated objects or the teacher's face in a mirror.",
    "Door knocks or bells: Sounds of someone knocking, doorbell ringing, or entering/exiting the room.",
    "Door opening or closing sounds",
    "Duplicate mic input from room and laptop",
    "Duplicate segment overlap",
    "Echoing participant interruptions: Someone unmuting to ask about logistics (e.g., 'When's the next class?') with their video feed popping up.",
    "Emotional or personal vents: Teacher venting about a bad day, with visible frustration (e.g., sighing, head in hands).",
    "Empty room recording continues",
    "End-of-class idle video",
    "End-of-session goodbyes: Extended farewells like 'See you next week, drive safe!' with waving or participant sign-offs visible.",
    "End-of-video dead air: Trailing silence after the class ends but before the recording stops, with a blank or static visual.",
    "Erasing board in silence",
    "Extended silences during thinking: Teacher pausing to think or read notes, with a static screen and no sound.",
    "Filler words and hesitations: Long and Excessive 'umms,' 'ahhs,' throat clearing, or repeated phrases like 'let me think' without progressing the content.",
    "Focus constantly drifting",
    "Forgotten pauses: Teacher stepping away briefly, leaving the camera on a empty chair or desk with no sound.",
    "Group activities gone off-track: Icebreaker games devolving into unrelated stories, with participant videos showing laughter.",
    "Group activity not related to lecture",
    "Holiday or event shoutouts: Greetings like 'Happy birthday to John!' with visual confetti effects or claps.",
    "Idle waiting for late joiners: Silent screen holding on a welcome slide while waiting for more participants.",
    "Interruptions from people off-camera: Family members or colleagues talking in the background, like a spouse asking about dinner or a child interrupting with unrelated questions.",
    "Irrelevant desktop pop-ups: Notifications from email, social media, or system updates appearing on the shared screen.",
    "Irrelevant slides or visuals: Accidental display of personal photos, unrelated tabs, or old slides from previous sessions.",
    "Jokes or humor unrelated to topic: Teacher telling a random joke or meme, with accompanying laughs or visual props (e.g., showing a funny image).",
    "Lens dirty or blurry",
    "Lighting flicker or shadow changes",
    "Lighting too bright or dark",
    "Long waits after asking a question, with blank chat or participant feeds silent.",
    "Mic feedback or screech noise",
    "Mic muted while teacher speaks",
    "Microphone handling or cable static",
    "Microphone muted accidentally",
    "Multiple audio inputs overlapping",
    "Music or sound effects not tied to content: Intro/outro music, hold music during breaks, or accidental playback of personal playlists.",
    "Muted segments: Accidental muting, leaving only visuals like the teacher gesturing silently.",
    "Network lag",
    "Noise interruption from hallway",
    "Off-topic Q&A diversions: Questions from participants about personal life (e.g., 'Where did you get that shirt?') and responses, with visible reactions.",
    "Off-topic announcements: Promotions for unrelated products, events, or services (e.g., 'Check out my new book on cooking' in a math class).",
    "Off-topic small talk at the start/end: Casual conversations like 'How's the weather there?' or 'Did you watch that game last night?' before diving into the topic or after wrapping up.",
    "Online audience delay",
    "Operator paused or idle",
    "Paper rustling or pen clicking",
    "Partial capture (cut off start or end)",
    "Participant chit-chat: Students or attendees talking among themselves about non-class topics (e.g., weekend plans) if mics are unmuted.",
    "Participant introductions: Round-robin 'Tell us about yourself' segments focusing on hobbies or jobs, not the subject.",
    "Participant video feeds: Other attendees' cameras showing off-topic activities, like someone eating or distracted by their phone.",
    "Personal anecdotes unrelated to the subject: Teacher sharing stories about their weekend, pets, or hobbies that don't illustrate an academic point.",
    "Personal conversation or jokes",
    "Phone rings or notifications: Incoming calls, text alerts, email pings, or app notifications sounding during the recording.",
    "Physical interruptions visible: Delivery person at the door, someone handing the teacher a note or item.",
    "Platform tutorials: Explaining how to use Zoom/Teams features (e.g., 'Click here to raise hand'), with on-screen demos unrelated to academics.",
    "Polls or icebreakers: Non-academic polls like 'What's your favorite food?' with on-screen results and discussion.",
    "Poor framing (half board visible)",
    "Post-class wind down or chatting",
    "Post-interruption recovery: Silent moments after a noise or glitch, as the teacher regroups without speaking.",
    "Power outage or blackout",
    "Pre-class setup (connecting cables",
    "Pre-class setup routines: Teacher testing mic/camera ('Can you hear me?'), adjusting setup, or waiting for participants to join, with visible fidgeting.",
    "Pre-class waiting time",
    "Projector blank screen",
    "Projector or computer fan humming",
    "Projector setup or adjusting screen",
    "Projector showing Zoom participants",
    "Props or objects not in use: Teacher handling unrelated items like a coffee mug or phone without speaking about them.",
    "Recording errors: Overlapping audio from previous takes, with mismatched visuals (e.g., teacher mouthing wrong words).",
    "Recording overlay visible (\"REC 00:12\")",
    "Repeated audio echo",
    "Roll call or attendance marking",
    "Sales pitches: Promoting merchandise or unrelated courses, with slides showing links or products.",
    "Screen lag between projector and Zoom",
    "Screen saver activation: Idle screen savers kicking in during pauses.",
    "Screen share idle (desktop visible)",
    "Setup silence (adjusting mic or light)",
    "Silent reading time",
    "Silent writing for long time",
    "Slide change without speaking",
    "Software loading waits: Waiting for apps/programs to load, with spinning wheels on screen and verbal comments like 'It's loading...'.",
    "Student background noise (keyboard typing, mic tapping, breathing sounds)",
    "Students asking off-topic questions",
    "Students chatting during task",
    "Students entering late and greeted",
    "Students entering or leaving room",
    "Students laughing or coughing",
    "Students off-task (phones",
    "Students responding to online chat",
    "Students talking among themselves",
    "Teacher addressing online students",
    "Teacher answering logistics (\"exam on Thursday\")",
    "Teacher distracted by phone",
    "Teacher far from mic (low audio)",
    "Teacher handling class discipline",
    "Teacher helping one student individually",
    "Teacher idle during screen share",
    "Teacher jokingly acts unrelated scene",
    "Teacher muttering to self",
    "Teacher operating computer silently",
    "Teacher pacing footsteps",
    "Teacher reacting to external visitor",
    "Teacher rearranging materials",
    "Teacher reviewing recording status",
    "Teacher saying \"can you hear me?\"",
    "Teacher silently writing on board",
    "Teacher talking to self \"is it recording?\"",
    "Teacher telling unrelated story",
    "Teacher thinking silently",
    "Teacher tidying or packing up",
    "Teacher toggling board and laptop view",
    "Teacher typing silently (no explanation)",
    "Teacher walking out of frame",
    "Teacher's personal actions: Adjusting clothing, fixing hair, eating/drinking, or checking their phone visibly.",
    "Technical delays without commentary: Silent loading screens or connection lags.",
    "Technical glitches and fixes: Screen freezing while the teacher says 'Hold on, let me fix this,' showing error messages or rebooting visuals.",
    "Technical problems (projector",
    "Technical reset silence",
    "Technical setup sounds (tripod, camera, mic movement)",
    "Technical troubleshooting audio: Verbal mutterings like 'Why isn't this working?' or 'Let me restart the app' while fixing non-academic issues.",
    "Time-lapse or fast-forward",
    "Transition pauses: Gaps between slides or topics, with no audio and a frozen image.",
    "Unreadable text on whiteboard or slide",
    "Unrelated demonstrations: Teacher showing off a gadget or app that's not educational (e.g., 'Look at this cool new phone feature').",
    "Visual glitches: Pixelation, color distortions, or video lag showing distorted irrelevant frames.",
    "Waiting for students to copy notes",
    "Waiting for students to settle",
    "Weather or external event commentary: Sudden remarks like 'Oh, it's raining outside' with no relevance.",
    "Weather/event disruptions: Sudden storm causing visual flickering (lights out) and audio comments like 'Power might go out.'",
    "Window views distractions: Outside scenery like people walking by or traffic, if the camera is pointed that way.",
    "Zoom notification or join sound"
]